[
    {
        "name": "LEGO WeDo", 
        "category": "Робототехника",
        "href": "course_lego.html",
        "images": ["img/course_lego_process.jpg"],
        "age": {
            "from": 6, 
            "to": 10
        },
        "course_duration": "",
        "lecture_duration": "",
        "place": "г. Подольск, ул. Февральская, д.65",
        "email": "v.boldyrev16@gmail.com",
        "phone": "+7 (916) 013-13-46",
        "snippet": "Lego WeDo – это образовательный конструкторский набор, который направлен на изучение робототехники с самого раннего возраста. Помимо обычных деталей оригинального набора «Lego», в набор Lego WeDo входят различные приборы, такие как моторы, датчики расстояния и поворота. В комплект также входит программное обеспечение, которое позволяет управлять собранной конструкцией.",
        "video": "https://www.youtube.com/embed/9No-FiEInLA",
        "tutor": {
            "name": "Сухочева Анна", 
            "about": "?", 
            "photo": ""
        },
        "structure": [
        	{
            	"title": "?",
            	"snippet": "?"
        	}
        ],
        "active": true
    },
    {
        "name": "BQ",
        "category": "Робототехника", 
        "href": "course_bq.html",
        "images": ["img/course_bq_process.jpg"],
        "age": {
            "from": 9, 
            "to": 13
        },
        "course_duration": "3 месяца",
        "lecture_duration": "2 академических часа",
        "place": "г. Подольск, ул. Февральская, д.65",
        "email": "v.boldyrev16@gmail.com",
        "phone": "+7 (916) 013-13-46",
        "snippet": "BQ – это новейший электронный конструктор, основанный на платформе Arduino, инструмент для создания электронных устройств, аппаратная вычислительная платформа. В основе конструктора — аппаратная часть: плата ввода-вывода. Специальный визуальный (блочный) язык программирования. Язык программирования предельно прост для понимания детей.",
        "video": "https://www.youtube.com/embed/9No-FiEInLA",
        "tutor": {
            "name": "Леженин Дмитрий",
            "about": "Студент МИФИ (Автоматика и электроника физических установок).<br> Hе первый год работает с микроконтроллерами, дружит с паяльником и умеет собирать не только компьютеры, но и роботов, уникальных по своим функциям.",
            "photo": "img/people_lezhenin.jpeg"
        },
        "structure": [
            {
                "title": "Введение",
                "snippet": "Знакомство учеников с программируемой платой и интерфейсом для программирования микроконтроллера."
            },
            {
                "title": "Светодиод",
                "snippet": "Знакомство с  различными видами ламп и их отличиями. Использование светодиода для сигнализации правильной работы устройства."
            },
            {
                "title": "Зуммер",
                "snippet": "Работа с “пищалкой”. Возможность написания своей мелодии для зуммера. (Например, музыка из Марио, Имперский марш из Звёздных войн)."
            },
            {
                "title": "Потенциометр",
                "snippet": "Знакомство учеников с основными понятиями - ток, напряжение, сопротивление. Использование потенциометра в различных регуляторах."
            },
            {
                "title": "Датчик освещённости",
                "snippet": "Принцип работы датчика, использование датчика в устройствах управления светом в помещении."
            },
            {
                "title": "Ультразвуковой датчик",
                "snippet": "Теория о распространении волн в пространстве. Изучение принципа работы датчика. Использование датчика для устройства определения расстояния."
            },
            {
                "title": "ИК - датчик",
                "snippet": "Теория об электромагнитных волнах и принципе работы датчика. Использование датчика для роботов различных типов."
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Написание программ и конструирование учениками собственных роботов с подсказками и наводками преподавателя."
            }
        ],
        "active": true
    },
    {
        "name": "Scratch",
        "category": "Создание игр",
        "href": "course_scratch.html",
        "images": ["img/course_scratch_process.jpg"],
        "age": {
            "from": 9, 
            "to": 13
        },
        "course_duration": "2 месяца",
        "lecture_duration": "4 академических часа",
        "place": "г. Подольск, ул. Февральская, д.65", 
        "email": "v.boldyrev16@gmail.com",
        "phone": "+7 (916) 013-13-46",
        "snippet": "На нашем курсе дети создадут свою собственную компьютерную игру и получат навыки программирования. В ходе занятий дети знакомятся с различными игровыми техниками, учатся строить логические связи, анализировать код, а также участвуют в мозговых штурмах с другими детьми. Прежде чем приступить к созданию своего игрового проекта, участники продумывают сюжет и игровую механику. Обучение проходит в детской среде разработки Scratch, где ребенок собирает игру из блоков наподобие конструктора.",
        "video": "https://www.youtube.com/embed/9No-FiEInLA",
        "tutor": {
            "name": "Дудкин Павел",
            "about": "Студент МИФИ (Автоматика и электроника).<br> Обладает знаниями и умениями создавать 2D и 3D игры в среде разработки Scratch, которая является на данный момент одной из самых популярных во всем мире. Также научит графическому дизайну и привьёт детям чувство стиля в вопросах создания сайтов.",
            "photo": "img/people_dudkin.jpeg"
        },
        "structure": [
            {
            	"title": "Знакомство со Scratch",
            	"snippet": "Ознакомиться со Scratch, его интерфейсом и всеми возможностями"
            },
            {
                "title": "Основы блочного программирования",
                "snippet": "Познакомиться с блочным программированием, понять, как все устроено и создание простой игры"
            },
            {
                "title": "Логические операторы, циклы",
                "snippet": "Познакомиться с понятиями логических операторов, циклов, научиться их применять и создать игру с ними"
            },
            {
                "title": "Работа с переменными",
                "snippet": "Познакомиться с понятием переменные, научиться их применять и создать игру с ними"
            },
            {
                "title": "Работа с графикой и координатами",
                "snippet": "Познакомиться с графическими эффектами и создать игру с использованием полученных знаний"
            },
            {
                "title": "Создание сложной игры",
                "snippet": "Создание игры с использованием всех знаний, полученных ранее"
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Продумывание своего собственного проекта и его реализация"
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Выполнение своего собственного проекта и презентация."
            }
        ],
        "active": true    
    },
    {
        "name": "Minecraft",
        "category": "Программирование",
        "href": "course_minecraft.html",
        "images": ["img/course_minecraft_process.jpg"],
        "age": {
            "from": 7, 
            "to": 13
        },  
        "course_duration": "2 месяца",
        "lecture_duration": "4 академических часа",
        "place": "г. Подольск, ул. Февральская, д.65",
        "email": "v.boldyrev16@gmail.com",
        "phone": "+7 (916) 013-13-46",
        "snippet": "Minecraft — это инди-игра в жанре песочницы, где можно строить сооружения, собирать предметы, добывать минералы и сражаться с монстрами. Она выглядит как трехмерный виртуальный мир, состоящий из разных кубических блоков; каждый блок занимает свое место в трехмерной решетке мира. Данный курс специально сделан для тех, кто не только любит играть, но и хочет создавать что-то новое. Вы сможете создавать собственные интерактивные игры, заниматься поиском сокровищ и даже возводить невероятные гигантские 2D- и 3D-объекты (сферы и пирамиды).",
        "video": "https://www.youtube.com/embed/9No-FiEInLA",
        "tutor": {
            "name": "Мешков Артём",
            "about": "Студент МИФИ (Автоматика и электроника).<br> С детства был увлечён компьютерными играми, на данный момент является участником команды по кибер спорту и выступает за свой университет на различных соревнованиях. Научит детей понимать суть каждой игры и создавать свои собственные сценарии.",
            "photo": "img/people_meshkov.jpeg"
        },
        "structure": [
            {
                "title": "Знакомство с Minecraft",
                "snippet": "Цель занятия: ознакомиться с Minecraft, научиться загружать и устанавливать модификации для данной игры."
            },
            {
                "title": "Основы блочного программирования",
                "snippet": "Цель занятия: Познакомиться с блочным программированием, понять, какой блок за что отвечает и создать простую программу."
            },
            {
                "title": "Условные операторы и переменные",
                "snippet": "Цель занятия: Познакомиться с понятиями переменной и условного оператора в программировании и научиться их применять для решения различных задач в игровом мире Minecraft."
            },
            {
                "title": "Циклы и вложенные циклы",
                "snippet": "Цель занятия: Узнать о циклах и вложенными циклах в программировании, как и где их можно применить как в Minecraft, так и в других программах."
            },
            {
                "title": "Создание искусственного интеллекта",
                "snippet": "Цель занятия: Научиться составлять более сложные программы, состоящие из простых. Создать свою собственную программу, которая строит небольшое красивое строение."
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Цель занятия: Продумывание своего собственного проекта и его реализация с помощью преподавателя и других учащихся."
            }
        ],
        "active": true 
     },
     {
         "name": "Arduino",
         "category": "Робототехника",
         "href": "course_arduino.html",
         "images": ["img/course_arduino.jpg"],
         "age": {
             "from": "?", 
             "to": "?"
         },
         "course_duration": "?",
         "lecture_duration": "?",
         "place": "г. Подольск, ул. Февральская, д.65 (институт экономики)",
         "email": "v.boldyrev16@gmail.com",
         "phone": "+7 (916) 013-13-46",
         "snippet": "?",
         "video": "https://www.youtube.com/embed/9No-FiEInLA",
         "tutor": {
             "name": "?",
             "about": "?",
             "photo": "?"
         },
         "structure": [],
         "active": false
     },
     {
         "name": "Python",
         "category": "Программирование",
         "href": "course_python.html",
         "images": ["img/course_python_process.jpg"],
         "age": {
             "from": 14
         },
         "course_duration": "3 месяца",
         "lecture_duration": "2 академических часа",
         "place": "г. Подольск, ул. Февральская, д.65",
         "email": "v.boldyrev16@gmail.com",
         "phone": "+7 (916) 013-13-46",
         "snippet": "?",
         "video": "https://www.youtube.com/embed/9No-FiEInLA",
         "tutor": {
             "name": "Денис Зуенко",
             "about": "Студент РУДН (факультет физико-математических и естественных наук).<br> За плечами Дениса уже не один десяток тысяч строк кода и множество реализованных программ. Любимый язык программирования - Python. Именно данный язык опыту Дениса является многопрофильным, простым, а также служит хорошей базой для работы в любой сфере IT.",
             "photo": "img/people_zuenko.png"
         },
         "structure": [
             {
                 "title": "Знакомство со средой разработки",
                 "snippet": "Установка, знакомство с интерфейсом."
             },
             {
                 "title": "Умножение, деление, возведение в степень, markdown.",
                 "snippet": "Познакомимся с основными математическими действиями, а также научимся делать заметки с помощью Latex."
             },
             {
                 "title": "Типы данных",
                 "snippet": "Рассмотрим основные типы данных, научимся их определять, а также преобразовывать."
             },
             {
                 "title": "Ввод, вывод",
                 "snippet": "Будем учиться использовать оператор input и print."
             },
             {
                 "title": "Логические операции",
                 "snippet": "Условные операторы, отступы. Познакомимся с математической логикой, в частности с булевыми операциями и, или, не."
             },
             {
                 "title": "Строки",
                 "snippet": "Научимся правильно записывать, выполнять операции с ними, а также делать заметки."
             },
             {
                 "title": "Задачи",
                 "snippet": "Помимо простых задач на закрепление пройденного урока, будем выполнять более сложные задания на применение всего того, чему мы научились в модуле."
             },
             {
                 "title": "Цикл while",
                 "snippet": "Знакомство с самым простым циклом."
             },
             {
                 "title": "Цикл For",
                 "snippet": "Научимся использовать более сложный цикл, работать с множеством элементов."
             },
             {
                 "title": "Строки и символы расширенно",
                 "snippet": "Рассмотрим строки как последовательность символов, а также методы для работы с ними."
             },
             {
                 "title": "Списки",
                 "snippet": "Познакомимся с основными методами работы со списками."
             },
             {
                 "title": "Задачи",
                 "snippet": "Помимо простых задач на закрепление пройденного урока, будем выполнять более сложные задания на применение всего того, чему мы научились в модуле."
             },
             {
                 "title": "Функции",
                 "snippet": "Знакомство с функциями, обсуждение нюансов."
             },
             {
                 "title": "Словари, множества",
                 "snippet": "Познакомимся с двумя типами данных очень похожих на списки, а также рассмотрим основных методы работы с ними, а также научимся значительно сокращать код"
             },
             {
                 "title": "Файловый ввод вывод",
                 "snippet": "Научимся работать с файлами разного типа."
             },
             {
                 "title": "Импорт модулей",
                 "snippet": "Зачем писать свои функции и алгоритмы когда, кто-то это сделал за нас?"
             },
             {
                 "title": "Задачи",
                 "snippet": "Пожалуй самая сложная и важная часть курса. Все что было изучено до этого не важно, если вы не можете решать задачи. А если вы решите данные задачи, то все остальные задачи покажуться вам слишком простыми."
             }
         ],
         "active": true
     },
     {
         "name": "C++",
         "category": "Программирование",
         "href": "course_cpp.html",
         "images": ["img/course_cpp_process.jpg"],
         "age": {
             "from": 14
         },
         "course_duration": "?",
         "lecture_duration": "?",
         "place": "г. Подольск, ул. Февральская, д.65",
         "email": "v.boldyrev16@gmail.com",
         "phone": "+7 (916) 013-13-46",
         "snippet": "На данном курсе будут изучаться основы программирования на языке C++,который является на сегодняшний день одним из самых востребованных в мире. Кроме того, это очень рациональный язык, позволяющий эффективно использовать вычислительные ресурсы и память компьютера. В ходе занятий будут рассмотрены основные задачи, способы их решения с аналитической точки зрения. В первой части курса изучается теория «с нуля», изучение кода и его элементов, во второй - обучающиеся будут создавать собственные проекты под руководством педагога.",
         "video": "https://www.youtube.com/embed/9No-FiEInLA",
         "tutor": {
             "name": "Cтрубалина Татьяна",
             "about": "Студент МИФИ (Информационная безопасность).<br> Начала увлекаться программированием еще в школе и имеет опыт разработки на языке С++ более 3ёх лет, не говоря уже про другие современные технологии. В настоящий момент под ее руководством находится сразу несколько групп по разным направлениям программирования.",
             "photo": "img/people_strubalina.jpeg"
         },
         "structure": [
             {
                 "title": "Знакомство с  C++",
                 "snippet": "Работа с консольным вводом-выводом. Первая простая программа. "
             },
             {
                 "title": "Типы данных и переменные. Арифметические операции в С++",
                 "snippet": "Знакомство с основными типами  данных в С++ и применение арифметических операций"
             },
             {
                 "title": "Условные циклы и операторы.",
                 "snippet": "Работа с логическим типом данных. Ветвление, организованное с помощью конструкции if else. Условные циклы, циклы с параметром и примеры их использования. "
             },
             {
                 "title": "Статические одномерные массивы.",
                 "snippet": "Использование массива для объединения некоторых данных. Алгоритмы сортировки данных и поиска нужного элемента. "
             },
             {
                 "title": "Работа со строками",
                 "snippet": "Способы задания строки. Ввод строки при помощи функции gets(). Реализация подсчета длины строки, объединение строк и перевод строки в другие типы данные (int,double,long int)."
             },
             {
                 "title": "Функции, передача параметров в функцию.",
                 "snippet": "Реализация собственных функций. Типы функций и результат их выполнения. "
             },
             {
                 "title": "Знакомство с ООП. ",
                 "snippet": "Знакомство с объектно-ориентированным программированием. Понятия и примеры, необходимые для понимания подхода. Объединение различных данных в классе и использование его  как отдельного типа данных."
             },
             {
                 "title": "Работа с динамической памятью. ",
                 "snippet": "Выделение необходимого объема памяти и ее освобождение внутри программы. "
             },
             {
                 "title": "Перегрузка операторов",
                 "snippet": "Определение пользовательских операторов для собственных типов данных"
             },
             {
                 "title": "Наследование",
                 "snippet": "Создание производных классов. Использование методов и элементов, унаследованных производным классом от базового."
             },
             {
                 "title": "Графическая оболочка",
                 "snippet": "Знакомство с основными графическими библиотеками. Создание и работа со стандартными окнами Windows."
             },
             {
                 "title": "Проектная деятельность",
                 "snippet": "Создание собственного приложения, разработанного на основе ООП, и (по-желанию), использующего графическую оболочку. "
             }
         ],
         "active": true
     },
     {
         "name": "WEB диазйн",
         "category": "Cоздание сайтов",
         "href": "course_web_design.html",
         "images": ["img/course_web_design_process.jpg", "img/course_web_design.png"],
         "age": {
             "from": 13
         },
         "course_duration": "1 месяц",
         "lecture_duration": "1 час",
         "place": "г. Подольск, ул. Февральская, д.65",
         "email": "v.boldyrev16@gmail.com",
         "phone": "+7 (916) 013-13-46",
         "snippet": "В ходе занятий дети научатся создавать яркий и красочный макет сайта, приобретут базовые навыки работы в графических редакторах, изучат основные элементы сайта и научатся сочетать цвета. По окончании курса у каждого ребёнка будет свой уникальный проект.",
         "video": "https://www.youtube.com/embed/9No-FiEInLA",
         "tutor": {
             "name": "Галушкин Семен",
             "about": "Студент МИФИ (Информационно-аналитические системы безопасности)<br>На сегодняшний день Семён обладает опытом  реализации проектов в сфере информационных технологий. Имеет навыки проектирования баз данных, работы с web дизайном, а также с языками администрирования.", 
             "photo": "img/people_galushkin.jpg"
         },
         "structure": [
             {
                 "title": "Знакомство со структурой сайта",
                 "snippet": "Изучение основных элементов и их расположения"
             },
             {
                 "title": "Диаграмма Иттена",
                 "snippet": "Получение знаний о правильном сочетании цветов"
             },
             {
                 "title": "Gimp, как графический редактор",
                 "snippet": "Изучение инструментов и принципа работы в нем"
             },
             {
                 "title": "Слои и их сведение",
                 "snippet": "Принцип работы с изображениями в рамках одного проекта"
             },
             {
                 "title": "Работа с цветом",
                 "snippet": "Работы с тоном, насыщенностью, яркостью и резкостью"
             },
             {
                 "title": "Проектная деятельность",
                 "snippet": "Создание собственного проекта"
             }
         ],
         "active": true 
     },
     {
         "name": "Unity3D",
         "category": "3D моделирование",
         "href": "course_unity3d.html",
         "images": ["img/course_unity.png", "img/course_unity_process.png"],
         "age": {
             "from": 9, 
             "to": 13
         },
         "course_duration": "?",
         "lecture_duration": "?",
         "place": "г. Подольск, ул. Февральская, д.65",
         "email": "v.boldyrev16@gmail.com",
         "phone": "+7 (916) 013-13-46",
         "snippet": "Unity 3D — это современный кросс-платформенный движок для разработки 2d и 3d приложений и игр, разработанный Unity Technologies. Приложения, созданные с помощью Unity, работают под различными операционными системами – Windows, OS X, Android, Apple iOS, Linux, а также на игровых приставках Wii, PlayStation 3 и Xbox 360. Unity 3D обладает огромным количеством преимуществ, среди которых: возможности импорта, тестирование игры непосредственно в редакторе, кросс-платформенность, инструментарий для совместной разработки, гибкость и масштабируемость, поддержка физики тканей и многое другое. Во время обучения вы изучите основы создания компьютерных игр, познакомитесь с движком Unity3D, 3D моделированием.",
         "video": "https://www.youtube.com/embed/9No-FiEInLA",
         "tutor": {
             "name": "Струбалина Татьяна",
             "about": "Студент МИФИ (Информационная безопасность).",
             "photo": "img/people_strubalina.jpeg"
         },
         "structure": [
             {
                 "title": "Знакомство",
                 "snippet": "Учеников с интерфейсом Unity, понятие gameObject и представление о компонентах игровых объектов."
             },
             {
                 "title": "Пользовательский интерфейс",
                 "snippet": "Стандартные объекты для создания пользовательского  интерфейса (UI-user interface). Добавление скриптов на игровые объекты."
             },
             {
                 "title": "Физика в Unity",
                 "snippet": "Rigidbody. Скрипт, реализующий движение. Настройка текстур. Простое следование камеры за объектов."
             },
             {
                 "title": "Настройка фона",
                 "snippet": "Skybox материал - настройка фона.Триггеры и их функционал."
             },
             {
                 "title": "Ассеты",
                 "snippet": "Unity Standard Assets, Characters, Vehicles. Переключение между управляемыми объектами."
             },
             {
                 "title": "Terrain и его инструменты",
                 "snippet": ""
             },
             {
                 "title": "Проектная деятельность 1 этап",
                 "snippet": "Выбор жанра, работа с ассетами, настройка текстуры."
             },
             {
                 "title": "Проектная деятельность 2 этап",
                 "snippet": "Написание скриптов, реализующих управление объектами и следование камеры за объектами. Доработка UI, тестирование игры."
             }
         ],
         "active": true 
    },
    {
        "name": "Inventor",
        "category": "3D моделирование",
        "href": "course_inventor.html",
        "images": ["img/inventor.jpg"],
        "age": {
            "from": 14
         },
        "course_duration": "3 месяца",
        "lecture_duration": "4 академических часа",
        "place": "г. Подольск, ул. Февральская, д.65",
        "email": "v.boldyrev16@gmail.com",
        "phone": "+7 (916) 013-13-46",
        "snippet": "Занятия по данному направлению проводятся с использованием современных программ, которые применяют для реализации промышленных проектов. Прохождение курса станет первым шагом к погружению в мир трехмерных технологий.",
        "video": "https://www.youtube.com/embed/9No-FiEInLA",
        "tutor": {
            "name": "Болдырев Владимир",
            "about": "Студент старших курсов МГТУ имени Баумана по направлению Робототехника и мехатроника.<br> Обладает навыками 3D моделирования и обучит этому всех желающих. На данный момент имеет опыт проектирования технически сложных объектов, обладает умением творчески подойти к любой, даже самой обычной задаче.",
            "photo": "img/people_boldyrev_gray.jpg"
        },
        "structure": [
            {
                "title": "Знакомство",
                "snippet": "Знакомство с интерфейсом, панелью управления, командной панелью. Работа с примитивами, создание объектов."
            },
            {
                "title": "Работа с объектами",
                "snippet": "Выделение, удаление, инструменты трансформации, клонирование, выравнивание и группировка. Простая визуализация."
            },
            {
                "title": "Модификаторы",
                "snippet": "Изучение простых модификаторов деформации объектов и их настройки."
            },
            {
                "title": "Булевские операции с объектами",
                "snippet": "Изучение булевских операция с объектами, управление операндами, клонирование объектов и зеркальное отражение объектов."
            },
            {
                "title": "Сплайны",
                "snippet": "Изучение плоской фигуры - сплайны. Основы создания сплайнов. Работа со сплайнами"
            },
            {
                "title": "Создание объектов из сплайнов",
                "snippet": "Изучение модификаторов Edit Spline, Extrude, Bevel, редактирование сплайнов и создание объектов."
            },
            {
                "title": "Модификатор Bevel Profile. Loft",
                "snippet": "Изучение модификатора Bevel Profile. Приемы моделирования простых форм Lofting, анализ объекта и построение схем лофтинга."
            },
            {
                "title": "Тела лофта",
                "snippet": "Создание и настройка тел лофта, редактирование сечений. Изучение кривых деформаций, компоновка сцены и внедрение объектов из одной сцены в другую."
            },
            {
                "title": "Основы полигонального моделирования",
                "snippet": "Изучение модификатора Edit Poly для редактирования сетки и операций Extrude, Bavel и т.д."
            },
            {
                "title": "Основы полигонального моделирования",
                "snippet": "Изучение модификатора сглаживания TurboSmooth и практика."
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Продумывание своего собственного проекта и его реализация."
            },
            {
                "title": "Проектная деятельность",
                "snippet": "Выполнение своего собственного проекта и презентация."
            }
        ],
        "active": true
    }
]

